<?php

return [
    'settings' => [
        'title' => 'تحسين',
        'description' => 'تقليل حجم مخرجات HTML، تضمين CSS، إزالة التعليقات...',
        'enable' => 'تمكين تحسين سرعة الصفحة؟',
    ],
    'collapse_white_space' => 'طي الفراغات البيضاء',
    'collapse_white_space_description' => 'يقلل هذا المرشح من عدد البايتات المرسلة في ملف HTML عن طريق إزالة الفراغات البيضاء غير الضرورية.',
    'elide_attributes' => 'إلغاء السمات',
    'elide_attributes_description' => 'يقلل هذا المرشح من حجم نقل ملفات HTML عن طريق إزالة السمات من العلامات عندما يكون القيمة المحددة تساوي القيمة الافتراضية لتلك السمة. يمكن أن يوفر هذا عددًا معتدلاً من البايتات، وقد يجعل الوثيقة أكثر ضغطًا من خلال تقييس العلامات المتأثرة.',
    'inline_css' => 'تضمين CSS',
    'inline_css_description' => 'يحول هذا المرشح سمة "النمط" المضمنة في العلامات إلى فئات من خلال نقل CSS إلى الرأس.',
    'insert_dns_prefetch' => 'إدراج DNS prefetch',
    'insert_dns_prefetch_description' => 'يحقن هذا المرشح علامات في الرأس لتمكين المستعرض من عملية DNS prefetching.',
    'remove_comments' => 'إزالة التعليقات',
    'remove_comments_description' => 'يقضي هذا المرشح على التعليقات في HTML، JS، و CSS. يقلل المرشح من حجم نقل ملفات HTML عن طريق إزالة التعليقات. يمكن أن يقلل هذا المرشح بشكل كبير من عدد البايتات المرسلة عبر الشبكة اعتمادًا على ملف HTML.',
    'remove_quotes' => 'إزالة علامات التنصيص',
    'remove_quotes_description' => 'يقضي هذا المرشح على علامات التنصيص الغير ضرورية من سمات HTML. على الرغم من أنها مطلوبة من قبل مواصفات HTML المختلفة، إلا أن المستعرضات تسمح بحذفها عندما تكون قيمة السمة تتألف من مجموعة معينة من الأحرف (الأبجدية وبعض رموز الترقيم).',
    'defer_javascript' => 'تأجيل تنفيذ الجافا سكريبت',
    'defer_javascript_description' => 'يؤجل تنفيذ الجافا سكريبت في HTML. إذا كان هناك حاجة إلى إلغاء التأجيل في بعض السيناريوهات، استخدم data-pagespeed-no-defer كسمة للإلغاء.',
];
