<?php

return [
    'cache_management' => 'إدارة الذاكرة المؤقتة',
    'cache_management_description' => 'مسح الذاكرة المؤقتة لجعل موقعك حديثًا.',
    'cache_commands' => 'أوامر مسح الذاكرة المؤقتة',
    'commands' => [
        'clear_cms_cache' => [
            'title' => 'مسح جميع ذاكرة التخزين المؤقت للنظام إدارة المحتوى',
            'description' => 'مسح ذاكرة التخزين المؤقت للنظام: تخزين قاعدة البيانات، الكتل الثابتة... قم بتشغيل هذا الأمر عندما لا ترى التغييرات بعد تحديث البيانات.',
            'success_msg' => 'تم مسح الذاكرة المؤقتة',
        ],
        'refresh_compiled_views' => [
            'title' => 'تحديث العروض المترجمة',
            'description' => 'مسح العروض المترجمة لجعل العروض حديثة.',
            'success_msg' => 'تم تحديث ذاكرة التخزين المؤقت للعروض',
        ],
        'clear_config_cache' => [
            'title' => 'مسح ذاكرة التخزين المؤقت للتكوين',
            'description' => 'قد تحتاج إلى تحديث تخزين التكوين عندما تغير شيئًا على بيئة الإنتاج.',
            'success_msg' => 'تم تنظيف ذاكرة التخزين المؤقت للتكوين',
        ],
        'clear_route_cache' => [
            'title' => 'مسح ذاكرة تخزين التوجيه',
            'description' => 'مسح ذاكرة التخزين المؤقت للتوجيه.',
            'success_msg' => 'تم مسح ذاكرة تخزين التوجيه',
        ],
        'clear_log' => [
            'title' => 'مسح السجل',
            'description' => 'مسح ملفات سجل النظام',
            'success_msg' => 'تم تنظيف سجل النظام',
        ],
    ],
];
