<?php

return [
    '401_title' => 'تم رفض الإذن',
    '404_title' => 'تعذر العثور على الصفحة',
    '500_title' => 'تعذر تحميل الصفحة',
    'reasons' => 'قد يكون ذلك بسبب عدة أسباب',
    'try_again' => 'يرجى المحاولة مرة أخرى في بضع دقائق، أو العودة إلى الصفحة الرئيسية عن طريق <a href=":link">النقر هنا</a>.',
    'not_found' => 'غير موجود',
    'results_not_found' => 'لم يتم العثور على نتائج!',
    'go_to_home' => 'الذهاب إلى الصفحة الرئيسية',
    'error_when_sending_email' => 'تعذر إرسال البريد الإلكتروني. هناك خطأ في إعدادات البريد الإلكتروني في الإدارة → الإعدادات → البريد الإلكتروني، يرجى التحقق من إعداداتك مرة أخرى.',
    'error_when_sending_email_guest' => 'تعذر إرسال البريد الإلكتروني. يرجى الاتصال بمسؤول الموقع إذا استمرت المشكلة.',
];
