<?php

return [
    'name' => 'العملاء المحتملون',
    'edit' => 'عرض العميل المحتمل',
    'statuses' => [
        'read' => 'تمت القراءة',
        'unread' => 'لم يتم القراءة',
    ],
    'phone' => 'الهاتف',
    'ip_address' => 'عنوان IP',
    'content' => 'التفاصيل',
    'lead_information' => 'معلومات العميل المحتمل',
    'email' => [
        'header' => 'البريد الإلكتروني',
        'title' => 'عميل جديد من موقعك',
        'success' => 'تم إرسال العميل بنجاح!',
        'failed' => 'لا يمكن إرسال الطلب في هذا الوقت، يرجى المحاولة مرة أخرى في وقت لاحق!',
    ],
    'form' => [
        'name' => [
            'required' => 'الاسم مطلوب',
        ],
        'email' => [
            'required' => 'البريد الإلكتروني مطلوب',
            'email' => 'عنوان البريد الإلكتروني غير صحيح',
        ],
        'content' => [
            'required' => 'الرسالة مطلوبة',
        ],
    ],
    'lead_sent_from' => 'تم إرسال معلومات هذا العميل المحتمل من',
    'time' => 'الوقت',
    'lead_id' => 'معرف العميل المحتمل',
    'form_name' => 'الاسم',
    'form_email' => 'البريد الإلكتروني',
    'form_phone' => 'الهاتف',
    'mark_as_read' => 'وضع علامة كمقروء',
    'mark_as_unread' => 'وضع علامة كغير مقروء',
    'new_lead_notice' => 'لديك <span class="bold">:count</span> عميل محتمل جديد',
    'view_all' => 'عرض الكل',
    'project' => 'المشروع',
    'property' => 'الوحدة',
];
