<?php

return [
    'name' => 'المواقع',
    'all_states' => 'جميع المحافظات',
    'abbreviation' => 'الاختصار',
    'abbreviation_placeholder' => 'مثال: CA',
    'enums' => [
        'import_type' => [
            'country' => 'دولة',
            'state' => 'محافظة',
            'city' => 'مدينة',
        ],
    ],
    'export' => [
        'total' => 'إجمالي المواقع',
        'total_countries' => 'إجمالي الدول',
        'total_states' => 'إجمالي المحافظات',
        'total_cities' => 'إجمالي المدن',
        'description' => 'قم بتصدير بيانات الموقع الخاصة بك مثل الدول والمحافظات والمدن.',
    ],
    'import' => [
        'description' => 'استورد بيانات الموقع بسهولة من البيانات المتاحة أو عن طريق تحميل ملف CSV / Excel.',
        'rules' => [
            'name' => 'اسم الموقع إلزامي ويجب ألا يتجاوز 120 حرفًا.',
            'slug' => 'إذا تم توفيره، يجب ألا يتجاوز طول اسم الموقع المعرف 120 حرفًا.',
            'import_type' => 'نوع الاستيراد إلزامي ويجب أن يكون أحد القيم المحددة مسبقًا.',
            'order' => 'ترتيب الموقع، إذا تم توفيره، يجب أن يكون عددًا صحيحًا إيجابيًا بين 0 و 127.',
            'abbreviation' => 'إذا تم توفيره، يجب ألا يتجاوز الاختصار للموقع 10 أحرف.',
            'status' => 'حالة الموقع إلزامية ويجب أن تكون أحد القيم المحددة مسبقًا.',
            'country' => 'حقل الدولة إلزامي إذا كان نوع الاستيراد محافظة أو مدينة.',
            'state' => 'حقل المحافظة إلزامي إذا كان نوع الاستيراد مدينة.',
            'nationality' => 'جنسية الموقع، إذا تم توفيره، يجب ألا يتجاوز 120 حرفًا.',
        ],
    ],
];
