<?php

return [
    'meta_box_header' => 'تحسين محركات البحث',
    'edit_seo_meta' => 'تعديل بيانات تحسين محركات البحث',
    'default_description' => 'قم بإعداد عنوان ووصف البيانات التعريفية لجعل موقعك سهل العثور عليه في محركات البحث مثل جوجل',
    'seo_title' => 'عنوان تحسين محركات البحث',
    'seo_description' => 'وصف تحسين محركات البحث',
    'seo_image' => 'صورة تحسين محركات البحث',
    'allow_index' => 'السماح لمحركات البحث بفهرسة هذه الصفحة',
    'index' => 'فهرسة',
    'noindex' => 'عدم فهرسة',
];
